In [1]:
import pandas as pd

In [3]:
df_s = pd.read_csv('sales_data.csv')
df_e = pd.read_csv('employee_data.csv')

In [4]:
df_s.head(5)

  TransactionID CustomerID SalesAmount PurchaseDate  EmployeeID
0        T00001      C0001      $2,824   01-11-2022           1
1        T00002      C0002      $1,409   19-11-2023           2
2        T00003      C0003      $5,506   09-10-2023           3
3        T00004      C0004      $5,012   04-02-2022           3
4        T00005      C0005      $4,657   28-10-2024           7

In [5]:
df_e.head(5)

   EmployeeID              Name  DepartmentID    Salary  SupervisorID
0           1  Cheyenne Padilla             5   $96,438           NaN
1           2    Michael Martin             5  $105,519           6.0
2           3        Tim Wright             4  $103,883           5.0
3           4     Kristy Archer             2  $111,213           1.0
4           5       Robert Rios             4  $145,561           3.0

In [15]:
print(df_s.info(), "\n")
print(df_e.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TransactionID  100 non-null    object
 1   CustomerID     100 non-null    object
 2   SalesAmount    100 non-null    object
 3   PurchaseDate   100 non-null    object
 4   EmployeeID     100 non-null    int64
dtypes: int64(1), object(4)
memory usage: 4.0+ KB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   EmployeeID    10 non-null     int64
 1   Name          10 non-null     object
 2   DepartmentID  10 non-null     int64
 3   Salary        10 non-null     object
 4   SupervisorID  9 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes
None

In [58]:
df_s_edit = df_s.copy()
df_e_edit = df_e.copy()

## Cleaning Sales Data

In [41]:
# we should remove '$' and ','
df_s_edit['SalesAmount'] = pd.to_numeric(df_s['SalesAmount'].replace({r'\$':'', ',':''}, regex=True), errors='coerce')

# used format becase the default is month-day-year which is not the case in our data
df_s_edit['PurchaseDate'] = pd.to_datetime(df_s['PurchaseDate'], format='%d-%m-%Y', errors='coerce')

In [42]:
df_s_edit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TransactionID  100 non-null    object
 1   CustomerID     100 non-null    object
 2   SalesAmount    100 non-null    int64
 3   PurchaseDate   100 non-null    datetime64[ns]
 4   EmployeeID     100 non-null    int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 4.0+ KB

In [49]:
df_s_clean = df_s_edit.copy()

## Cleaning Employee Data

In [60]:
# we should remove '$' and ','
df_e_edit['Salary'] = pd.to_numeric(df_e['Salary'].replace({r'\$':'', ',':''}, regex=True), errors='coerce')

# we can't convert NaN to int so we made it 0 (we can also make it string and add something like "No Supervisor" in the cell)
df_e_edit['SupervisorID'] = df_e_edit['SupervisorID'].fillna(0).astype(int)

In [61]:
df_e_edit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   EmployeeID    10 non-null     int64
 1   Name          10 non-null     object
 2   DepartmentID  10 non-null     int64
 3   Salary        10 non-null     int64
 4   SupervisorID  10 non-null     int64
dtypes: int64(4), object(1)
memory usage: 532.0+ bytes

In [54]:
df_e_clean = df_e_edit.copy()

## Converting to csv

In [55]:
df_s_clean.to_csv('sales_data_clean.csv')
df_e_clean.to_csv('employee_data_clean.csv')